export const questions = [
    {
        title: 'React - це ... ?',
        variants: ['бібліотека', 'фреймворк', 'додаток'],
        correct: 0,
    },
    {
        title: 'Компонент - це ... ',
        variants: ['додаток', 'частина додатка або сторінки', 'те, що я не знаю що таке'],
        correct: 1,
    },
    {
        title: 'Що таке JSX?',
        variants: [
            'Це простий HTML',
            'Це функція',
            'Це той самий HTML, але з можливістю виконувати JS-код',
        ],
        correct: 2,
    },
    {
        title: 'Що таке state в React?',
        variants: [
            'Це постійні дані',
            'Це внутрішній стан компонента',
            'Це властивість компонента',
        ],
        correct: 1,
    },
    {
        title: 'Яка мета використання props?',
        variants: [
            'Передача властивостей від батьківського компонента до дочірнього',
            'Збереження стану компонента',
            'Виклик функції',
        ],
        correct: 0,
    },
    {
        title: 'Що таке Virtual DOM?',
        variants: [
            'Копія реального DOM',
            'Абстракція поверх реального DOM, яка полегшує оновлення інтерфейсу',
            'Функція для створення компонентів',
        ],
        correct: 1,
    },
    {
        title: 'Для чого використовують useEffect?',
        variants: [
            'Для створення компонентів',
            'Для управління побічними ефектами в функціональних компонентах',
            'Для оновлення стану компонента',
        ],
        correct: 1,
    },
    {
        title: 'Що робить метод setState?',
        variants: [
            'Оновлює стан компонента',
            'Створює новий компонент',
            'Видаляє компонент',
        ],
        correct: 0,
    },
    {
        title: 'Що таке Redux?',
        variants: [
            'Бібліотека для управління станом',
            'Фреймворк для створення додатків',
            'Мова програмування',
        ],
        correct: 0,
    },
    {
        title: 'Що таке HOC (Higher-Order Component)?',
        variants: [
            'Компонент, який отримує інші компоненти як аргументи і повертає новий компонент',
            'Функція для створення компонентів',
            'Метод для оновлення стану компонента',
        ],
        correct: 0,
    },
];